src/test/artillery/load-test.yml
config:
  target: "http://localhost:8910"
  phases:
  - duration: 120
    arrivalRate: 50
  processor: "./processor.js"
  variables:
    origin: "http://localhost:8888"
  environments:
    docker:
      phases:
      - duration: 60
        arrivalRate: 10
      target: "http://localhost:3001"
      variables:
        origin: "http://localhost:3000"
    prod:
      phases:
      - duration: 60
        arrivalRate: 10
      target: "https://gw.trajano.net"
      variables:
        origin: "https://ms.trajano.net"
scenarios:
- flow:
  - get:
      url: "/jwks"
  - get:
      url: "/v1"
- flow:
  - post:
      url: "/v1/authn"
      json:
        username: archie
        password: password
      headers:
        Accept: application/json
        Content-Type: application/json
        Authorization: Basic YXBwX2lkOmFwcF9zZWNyZXQ=
      capture:
      - json: "$.access_token"
        as: "access_token"
      - json: "$.refresh_token"
        as: "refresh_token"
  - get:
      url: "/v1/secure"
      headers:
        Accept: application/json
        Authorization: "Bearer {{ access_token }}"
        Origin: "{{ origin }}"
  - post:
      url: "/refresh"
#      beforeRequest: "logRequest"
#      afterResponse: "logHeaders"
      form:
        grant_type: refresh_token
        refresh_token: "{{ refresh_token }}"
      headers:
        Accept: application/json
        Content-Type: application/x-www-form-urlencoded
        Authorization: Basic YXBwX2lkOmFwcF9zZWNyZXQ=
        Origin: "{{ origin }}"
      capture:
      - json: "$.access_token"
        as: "access_token"
      - json: "$.refresh_token"
        as: "refresh_token"
  - get:
      url: "/v1/secure"
      headers:
        Accept: application/json
        Authorization: "Bearer {{ access_token }}"
        Origin: "{{ origin }}"
  - get:
      url: "/v1/hello/null"
      headers:
        Accept: application/json
        Authorization: "Bearer {{ access_token }}"
        Origin: "{{ origin }}"
#  - get:
#      url: "/v1/hello/openid"
#      headers:
#        Accept: application/json
#        Authorization: "Bearer {{ access_token }}"
#        Origin: "{{ origin }}"